SOAPUtil/bin/msg/CISACTAI_RQ.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:leg="http://com.seagullsw.appinterface/LegasuiteCICSEngine" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/>
   <soapenv:Body>
      <leg:PLACPHLD>
         <IDA-TC-COMMAREA-PARAMETERS>
            <!--You may enter the following 6 items in any order-->
            <IDA-TC-COMM-HEADER>
               <!--You may enter the following 12 items in any order-->
               <!--Optional:-->
               <IDA-TC-HR-CICS-TC>XWAA</IDA-TC-HR-CICS-TC>
               <!--Optional:-->
               <IDA-TC-HR-BANK-NO>1</IDA-TC-HR-BANK-NO>
               <!--Optional:-->
               <IDA-TC-HR-BRANCH-NO>22</IDA-TC-HR-BRANCH-NO>
               <!--Optional:-->
               <IDA-TC-HR-OPER-ID>00032</IDA-TC-HR-OPER-ID>
               <!--Optional:-->
               <IDA-TC-HR-TERM-ID/>
               <!--Optional:-->
               <IDA-TC-HR-TRAN-DATE>22018</IDA-TC-HR-TRAN-DATE>
               <!--Optional:-->
               <IDA-TC-HR-TRAN-TIME>91603</IDA-TC-HR-TRAN-TIME>
               <!--Optional:-->
               <IDA-TC-HR-APPL-ID>IDA</IDA-TC-HR-APPL-ID>
               <!--Optional:-->
               <IDA-TC-HR-IO-CODE>00</IDA-TC-HR-IO-CODE>
               <!--Optional:-->
               <IDA-TC-HR-MAINT-TYPE-CD/>
               <!--Optional:-->
               <IDA-TC-HR-APPL-TRN-CD>378</IDA-TC-HR-APPL-TRN-CD>
               <!--Optional:-->
               <IDA-TC-HR-NO-OF-CARDS>2</IDA-TC-HR-NO-OF-CARDS>
            </IDA-TC-COMM-HEADER>
            <IDA-TC-TRANS-TABLE-1>
               <!--You may enter the following 8 items in any order-->
               <!--Optional:-->
               <I-IDA-C000-BANK-NUMBER>1</I-IDA-C000-BANK-NUMBER>
               <!--Optional:-->
               <I-IDA-C000-ACCOUNT-NUMBER>22343571</I-IDA-C000-ACCOUNT-NUMBER>
               <!--Optional:-->
               <I-IDA-C000-INTERNAL-TRAN-CODE>378</I-IDA-C000-INTERNAL-TRAN-CODE>
               <!--Optional:-->
               <I-IDA-C378-CARD-ID-1>1</I-IDA-C378-CARD-ID-1>
               <!--Optional:-->
               <I-IDA-C378-TYPE-OF-HOLD>610</I-IDA-C378-TYPE-OF-HOLD>
               <!--Optional:-->
               <I-IDA-C378-CHECK-HOLD-AMOUNT>100.00</I-IDA-C378-CHECK-HOLD-AMOUNT>
               <!--Optional:-->
               <I-IDA-C378-SAVING-HOLD-AMOUNT>100.00</I-IDA-C378-SAVING-HOLD-AMOUNT>
               <!--Optional:-->
               <I-IDA-C378-DRAWER-INFORMATION>TEST</I-IDA-C378-DRAWER-INFORMATION>
            </IDA-TC-TRANS-TABLE-1>
            <IDA-TC-TRANS-TABLE-2>
               <!--You may enter the following 11 items in any order-->
               <!--Optional:-->
               <I-IDA-C000-BANK-NUMBER-2>1</I-IDA-C000-BANK-NUMBER-2>
               <!--Optional:-->
               <I-IDA-C000-ACCOUNT-NUMBER-2>22343571</I-IDA-C000-ACCOUNT-NUMBER-2>
               <!--Optional:-->
               <I-IDA-C000-INTERNAL-TRAN-CODE-2>378</I-IDA-C000-INTERNAL-TRAN-CODE-2>
               <!--Optional:-->
               <I-IDA-C378-CARD-ID-2>2</I-IDA-C378-CARD-ID-2>
               <!--Optional:-->
               <I-IDA-C378-AVAILABILITY-DAYSX>05</I-IDA-C378-AVAILABILITY-DAYSX>
               <!--Optional:-->
               <I-IDA-C378-DELAY-DAYSX>02</I-IDA-C378-DELAY-DAYSX>
               <!--Optional:-->
               <I-IDA-C378-DATE-PLACEDX>022018</I-IDA-C378-DATE-PLACEDX>
               <!--Optional:-->
               <I-IDA-C378-REFERENCE-NUMBER>25897846509124</I-IDA-C378-REFERENCE-NUMBER>
               <!--Optional:-->
               <I-IDA-C378-RESERVE-HOLD-AMOUNT>100.00</I-IDA-C378-RESERVE-HOLD-AMOUNT>
               <!--Optional:-->
               <I-IDA-C378-OPERATOR-ID>32</I-IDA-C378-OPERATOR-ID>
               <!--Optional:-->
               <I-IDA-C378-CK-SER-NO>1256</I-IDA-C378-CK-SER-NO>
            </IDA-TC-TRANS-TABLE-2>
            <!--Optional:-->
            <IDA-TC-TRANS-TYPE>O</IDA-TC-TRANS-TYPE>
            <!--Optional:-->
            <IDA-TC-ORIGIN>U</IDA-TC-ORIGIN>
            <!--Optional:-->
            <IDA-TC-TANDEM-IND>Y</IDA-TC-TANDEM-IND>
         </IDA-TC-COMMAREA-PARAMETERS>
      </leg:PLACPHLD>
   </soapenv:Body>
</soapenv:Envelope>